---
kind: type
id: T:Autodesk.Revit.DB.Visual.AssetPropertyString
source: html/714d66c8-caf4-64d3-0f6e-2a743d6428d5.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyString

Represents a property of material.

## Syntax (C#)
```csharp
public class AssetPropertyString : AssetProperty
```